# მომხმარებელისგან რიცხვების მიღება
number1 = float(input("შეიტანეთ პირველი რიცხვი: "))
number2 = float(input("შეიტანეთ მეორე რიცხვი: "))
number3 = float(input("შეიტანეთ მესამე რიცხვი: "))
number4 = float(input("შეიტანეთ მეოთხე რიცხვი: "))

# საშუალო არითმეტიკულის გამოთვლა
average = (number1 + number2 + number3 + number4) / 4

# შედეგის გამოყვანა
print("რიცხვების საშუალო არითმეტიკული არის:", average)


# სახელი და გვარი მოთხოვნილი
name = input("შეიტანეთ თქვენი სახელი: ")
surname = input("შეიტანეთ თქვენი გვარი: ")

# ტექსტის გამოტანა
print("მოგესალმები, " + name + " " + surname + "!")


